In [1]:
import numpy as np
import pandas as pd

In [12]:
havaDurumuDF = pd.DataFrame({"Istanbul":[30,29,np.nan],"Ankara": [20,np.nan,25],"Izmir": [40,39,38]})

In [13]:
havaDurumuDF # Eksik verilerle başa çıkma

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [14]:
havaDurumuDF.dropna() # nan değerleri drop etti, fakat bir satırda bir tane nan olsa bile hepsini çıkarttı

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [15]:
havaDurumuDF.dropna(axis = 1) # na olmayan tek kolonu getirdik böylece

   Izmir
0     40
1     39
2     38

In [16]:
# nan lar yüzünden bütün sırayı silmek mantıksız

In [19]:
yeniVeriDF = pd.DataFrame({"Istanbul":[30,29,np.nan],"Ankara": [20,np.nan,25],"Izmir": [40,39,38],"Antalya":[45,np.nan,np.nan]})
yeniVeriDF = pd.DataFrame(yeniVeriDF)

In [20]:
yeniVeriDF

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [21]:
# 2 nan olanları drop et, tek nan olanları drop etme diyeceğiz

In [23]:
yeniVeriDF.dropna(axis = 1, thresh = 2) # thresh = limit koymak demek

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [25]:
# Boş olan verilere standart bir rakam yazmak istersek

In [26]:
yeniVeriDF

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [30]:
yeniVeriDF.fillna(20,inplace=True) # kalıcı olarak verilere 20 sayısını atadım.

In [29]:
yeniVeriDF

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

# Group By Methodu
- row larımızı grupluyor.
- multiindex olmasına gerek olmadan herhangi bir kolondan gruplama yapabiliyoruz

In [39]:
maasSozlugu = {"Departman": ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"], 
               "Calısan İsmi" : ["Fatma","Kagan","Dilara","Zeynep","Ali","Mehmet"],
               "Maas": [100,200,300,400,500,600]
               }

In [40]:
maasDF = pd.DataFrame(maasSozlugu)

In [41]:
maasDF

   Departman Calısan İsmi  Maas
0    Yazılım        Fatma   100
1    Yazılım        Kagan   200
2  Pazarlama         Atil   300
3  Pazarlama       Zeynep   400
4      Hukuk          Ali   500
5      Hukuk       Mehmet   600

In [42]:
maasDF.groupby("Departman")

In [43]:
grupObjesi = maasDF.groupby("Departman")

In [45]:
grupObjesi.count()

           Calısan İsmi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [46]:
grupObjesi.mean()

           Maas
Departman
Hukuk       550
Pazarlama   350
Yazılım     150

In [47]:
grupObjesi.min()

          Calısan İsmi  Maas
Departman
Hukuk              Ali   500
Pazarlama         Atil   300
Yazılım          Fatma   100

In [48]:
grupObjesi.max()

          Calısan İsmi  Maas
Departman
Hukuk           Mehmet   600
Pazarlama       Zeynep   400
Yazılım          Kagan   200

In [50]:
grupObjesi.describe() # özelliklerin hepsini benim için hesapladı

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
Pazarlama   2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Yazılım     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0

# Concatenation 
- Birleştirmek demek
- alt alta koyuyor
- kolon isimleri aynıysa kullan

In [68]:
sozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Yasemin"], "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
           "Kalori" : [100,200,300,400] }

In [54]:
df = pd.DataFrame(sozluk1, index = [0,1,2,3])

In [55]:
df

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3  Yasemin  Basketbol     400

In [61]:
sozluk2 = {"Isim" : ["Melis","Tuğçe","İrem","Özge"], "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
           "Kalori" : [200,500,600,350] }

In [62]:
df2 = pd.DataFrame(sozluk2, index = [4,5,6,7])

In [63]:
sozluk3 = {"Isim" : ["İrem","Uzay","Cevher","Nur"], "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
           "Kalori" : [370,210,850,400] }

In [64]:
df3 = pd.DataFrame(sozluk3, index = [8,9,10,11])

In [65]:
df

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3  Yasemin  Basketbol     400

In [66]:
df2

    Isim       Spor  Kalori
4  Melis       Koşu     200
5  Tuğçe      Yüzme     500
6   İrem       Koşu     600
7   Özge  Basketbol     350

In [67]:
df3

      Isim       Spor  Kalori
8     İrem       Koşu     370
9     Uzay      Yüzme     210
10  Cevher       Koşu     850
11     Nur  Basketbol     400

In [74]:
Total  = pd.concat([df,df2,df3], axis = 0)

In [75]:
Total

       Isim       Spor  Kalori
0     Ahmet       Koşu     100
1    Mehmet      Yüzme     200
2    Zeynep       Koşu     300
3   Yasemin  Basketbol     400
4     Melis       Koşu     200
5     Tuğçe      Yüzme     500
6      İrem       Koşu     600
7      Özge  Basketbol     350
8      İrem       Koşu     370
9      Uzay      Yüzme     210
10   Cevher       Koşu     850
11      Nur  Basketbol     400

# Merge 
- Birleştirmek / Kaynaştırmak anlamına geliyor

In [76]:
mergeSozluk1 = {"Isim" : ["Tuğçe","Yasemin","Zeynep","Atıl"],
               "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"]}

In [77]:
mergeDF1 = pd.DataFrame(mergeSozluk1)

In [78]:
mergeDF1

      Isim       Spor
0    Tuğçe       Koşu
1  Yasemin      Yüzme
2   Zeynep       Koşu
3     Atıl  Basketbol

In [84]:
mergeSozluk2 = {"Isim" : ["Tuğçe","Yasemin","Zeynep","Atıl"],
               "Kalori" : [100,200,300,400]}

In [85]:
mergeDF2 = pd.DataFrame(mergeSozluk2)

In [86]:
mergeDF2

      Isim  Kalori
0    Tuğçe     100
1  Yasemin     200
2   Zeynep     300
3     Atıl     400

In [87]:
pd.merge(mergeDF1,mergeDF2,on="Isim")

      Isim       Spor  Kalori
0    Tuğçe       Koşu     100
1  Yasemin      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400

In [88]:
maasSozluk = {"Isimler" : ["Tuğçe","Sevgi","Alperen","Nazmi"],
             "Departman" : ["Yazılım","Satis","Pazarlama","Yazılım"],
             "Maas": [300,200,350,100]}

In [89]:
maasDF = pd.DataFrame(maasSozluk)

In [90]:
maasDF

   Isimler  Departman  Maas
0    Tuğçe    Yazılım   300
1   Şerife      Satis   200
2  Yasemin  Pazarlama   350
3    Irfan    Yazılım   100

In [93]:
maasDF["Departman"].unique() # unique = tekilleri getirir.

array(['Yazılım', 'Satis', 'Pazarlama'], dtype=object)

In [95]:
maasDF["Departman"].nunique() # nunique = number unique

3

In [97]:
maasDF["Departman"].value_counts() # kaç insan var departmanlarda

Yazılım      2
Pazarlama    1
Satis        1
Name: Departman, dtype: int64

In [99]:
def bruttenNete(maas):
    return maas * 0.66

In [101]:
maasDF["Maas"].apply(bruttenNete) # .apply ile fonksiyonları dataframe gayet kolay uygulayabiliyoruz.

0    198.0
1    132.0
2    231.0
3     66.0
Name: Maas, dtype: float64

In [103]:
maasDF.isnull() # null değer var mı diye sordum, false veriyor yani yok diyor

   Isimler  Departman   Maas
0    False      False  False
1    False      False  False
2    False      False  False
3    False      False  False

## Pivot Table

In [114]:
yeniVeri = {"Karakter" : ["South Park","South Park","Simpson","Simpson","Simpson"],
           "Karakter Ismi" : ["Cartman","Kenny","Homer","Bart","Bart"],
            "Karakter Yas" : [9,10,50,20,10]
           }

In [115]:
karakterDF = pd.DataFrame(yeniVeri)

In [116]:
karakterDF

     Karakter Karakter Ismi  Karakter Yas
0  South Park       Cartman             9
1  South Park         Kenny            10
2     Simpson         Homer            50
3     Simpson          Bart            20
4     Simpson          Bart            10

In [119]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter", "Karakter Ismi"], aggfunc = np.sum)  # aynı isimşilerin yaşlarını toplattım.

                          Karakter Yas
Karakter   Karakter Ismi
Simpson    Bart                     30
           Homer                    50
South Park Cartman                   9
           Kenny                    10